{"layout":"hnz-theme","sections":{"hnz-order-1":{"type":"hnz-order-1","disabled":true,"settings":{"paypal_apr":"0%","paypal_details":"4 months, $104.12\/month","klarna_apr":"0%","klarna_details":"4 months, $104.12\/month","payment_method":"shopify:\/\/shop_images\/payment.png","payment_url":"#","delivery_1":"<b>US version:<\/b> Delivered in 3-7 business days","delivery_2":"<b>UK & EU Version Pre-Sale:<\/b> Delivered in about 80 days after you place the order.","shipping_1":"Ships in 2 business days from the United States","shipping_2":"Free Shipping & 14-day trial & 2-year warranty"}},"city_vanture_section_1_new_JbTCea":{"type":"city-vanture-section-1-new","settings":{"paypal_apr":"","paypal_details":"","klarna_apr":"","klarna_details":"","payment_method":"shopify:\/\/shop_images\/Untitled_design_80.png","payment_url":"shopify:\/\/pages\/payment-method","shipping_1":"","shipping_2":"","series_collect":""}},"grandteton_parameters_KmijmW":{"type":"grandteton-parameters","settings":{}},"urbancross_ultra_features_Q6axLB":{"type":"urbancross-ultra-features","blocks":{"column_MPBa4e":{"type":"column","settings":{"tab_image":"shopify:\/\/shop_images\/1_5.png","tab_title":"Compact Folding Design","tab_description":"Fold and go in just 15 seconds with CommuteMate’s easy folding system! Four simple steps allow you to quickly store or transport it wherever you need, making it ideal for travel and outdoor adventures."}},"column_XbYY3Y":{"type":"column","settings":{"tab_image":"shopify:\/\/shop_images\/2_1_1985c84c-acce-48be-a0c5-3cca3deabecc.png","tab_title":"Bright LED Lights","tab_description":"Ride confidently day or night! Equipped with both front and rear LED lights, CommuteMate’s rear light also functions as a brake light for extra visibility and safety."}},"column_ax7CDm":{"type":"column","settings":{"tab_image":"shopify:\/\/shop_images\/3_3_81d6af35-d19c-4515-9c9d-d94f8d51cd1a.png","tab_title":"Powerful 750W Motor","tab_description":"Tackle any terrain with ease! The 750W rear hub motor provides strong acceleration and impressive climbing power, making every ride effortless. Plus, it’s UL 2849 certified for safe, reliable performance."}},"column_Vdfrdj":{"type":"column","settings":{"tab_image":"shopify:\/\/shop_images\/4_2_6ac004f6-ea90-4113-9939-9c81cb4d2dac.png","tab_title":"Advanced Hydraulic Disc Brakes","tab_description":"Stop with precision and confidence. CommuteMate’s 180mm hydraulic disc brakes deliver exceptional stopping power in all weather conditions, enhancing safety and control on every ride."}},"column_yaL6iB":{"type":"column","settings":{"tab_image":"shopify:\/\/shop_images\/751_2.png","tab_title":"Sleek Color TFT-LCD Display","tab_description":"Stay informed and connected with the modern 3.5\" color TFT-LCD display, complete with a USB-A port. Clear visuals and easy navigation make it a stylish yet practical addition."}},"column_CcJLwa":{"type":"column","settings":{"tab_image":"shopify:\/\/shop_images\/6_4.png","tab_title":"Shimano 7-Speed Gear System","tab_description":"Experience smooth and versatile shifting with the Shimano 7-speed gear system. Adapt your speed to match your journey and enjoy an efficient, customizable ride."}},"column_FTtpd9":{"type":"column","settings":{"tab_image":"shopify:\/\/shop_images\/7_2.png","tab_title":"20\"x3\" Fat Tires","tab_description":"Enjoy unbeatable traction with 20\"x3\" fat tires, designed to prevent skidding and slipping. Ride smoothly over any surface, from city streets to rugged trails."}},"column_gtRhi8":{"type":"column","settings":{"tab_image":"shopify:\/\/shop_images\/8_3.png","tab_title":"Connected with VanLife App","tab_description":"Seamlessly connect with the VanLife App to monitor stats, track performance, and plan your routes."}}},"block_order":["column_MPBa4e","column_XbYY3Y","column_ax7CDm","column_Vdfrdj","column_yaL6iB","column_CcJLwa","column_FTtpd9","column_gtRhi8"],"settings":{"heading_text":"Features","custom_button_text":"Explore","custom_button_link":""}},"aftersales_terms_YACLCt":{"type":"aftersales-terms","blocks":{"text_Jqb3bG":{"type":"text","settings":{"icon":"shopify:\/\/shop_images\/4_1.webp","title":"Lightning Fast & Free Shipping","body":"Enjoy fast, free shipping on all your orders, ensuring your e-bike arrives quickly and at no extra cost."}},"text_zFGbje":{"type":"text","settings":{"icon":"shopify:\/\/shop_images\/4_2.webp","title":"Up To 6-Year Warranty","body":"Ride with confidence with our up to 6-year warranty, covering your e-bike for years of worry-free use."}},"text_jmC3dJ":{"type":"text","settings":{"icon":"shopify:\/\/shop_images\/4_3.webp","title":"Hassle-Free After Sale","body":"Experience a smooth, hassle-free buying process with easy returns and dedicated customer support."}}},"block_order":["text_Jqb3bG","text_zFGbje","text_jmC3dJ"],"settings":{"show":true}},"grandteton_boxs_giL8en":{"type":"grandteton-boxs","settings":{}},"hnz-product-review":{"type":"hnz-product-review","settings":{"show":true,"title":"What Our Clients Say"}},"recent-products":{"type":"recent-products","disabled":true,"settings":{"heading":"Recently Viewed"}},"hnz_product_ug_pro_8_GbmLBN":{"type":"hnz-product-ug-pro-8","blocks":{"text_QqAWPn":{"type":"text","settings":{"title":"Which payment methods do Vanpowers. bike accept?","answer":"You can pay with a credit card (Mastercard\/Visa), PayPal, or Klana.\n\nIf your credit card was declined or your payment failed, this may be due to your bank's automated anti-fraud systems or your payment limit. Please make sure your credit card information was entered correctly, or try another payment method.\n\nIf the transaction still doesn't go through, please contact your bank to make sure nothing is blocking the payment. If everything looks good from the bank's side, please get in touch with our support team, and we'll diagnose the problem.\n\nIf you have any problems with payment, please get in touch with our Customer Support team."}},"text_ieHteJ":{"type":"text","settings":{"title":"How can I cancel my order?","answer":"We're sorry to hear you'd like to cancel your order. Cancellations are possible until our Warehouse team starts preparing your order for shipment. You can cancel your order in your My Vanpowers account. Sign in to your Vanpowers account and go to 'Orders'. Click on the 'Cancel Order' button and follow the steps.\n\nIf you can't see this button, we've already prepared your order for shipment, and unfortunately, a cancellation may no longer be possible. If you still want to cancel, please contact our Customer Support team."}},"text_Xfpfx9":{"type":"text","settings":{"title":"Can I get a quote for a bike?","answer":"The prices of our bikes are listed on our website. You'll see an overview of the total costs, including shipping, at the checkout page when placing an order. We cannot provide individual quotes outside of this. If you want to know more, you can refer to the Terms & Conditions. \n\nYour data is handled confidentially and encrypted with SSL secure server software. Information regarding your order, name, address, credit card, or bank details is encrypted and cannot be read by any third party. If you want to know more, you can refer to the privacy policy."}},"text_7pxnzW":{"type":"text","settings":{"title":"When do I get the invoice for my order?","answer":"Your invoice will be available as your order leaves our warehouse. You will receive the invoice by email, and you can also download it from your Vanpowers account.\n\nIt is not possible to issue an invoice before your bike is shipped."}},"text_pPXKK7":{"type":"text","settings":{"title":"Does it ship to Canada\/Australia\/Japan?","answer":"No, but please register your email and name, and we will contact you."}},"text_7UPbYt":{"type":"text","settings":{"title":"Is shipping included in the price?","answer":"No, shipping fees vary depending on your country of delivery. They will be shown and calculated during the checkout. You can refer to the shipping policy."}},"text_qNLinU":{"type":"text","settings":{"title":"When will I be able to track my order?","answer":"You can check your order status on your Vanpowers account. If your bike has already been shipped, you'll receive a track & trace email from our shipping partner, and you can also track your order number by clicking Track orders."}},"text_mXyRh6":{"type":"text","settings":{"title":"Can I change my delivery address?","answer":"If your bike hasn't been shipped yet and you would like to change your delivery address, you can contact us.\n\nIf you have other shipping consulting questions, refer to our shipping policy."}},"text_GRqdCx":{"type":"text","settings":{"title":"If your bike hasn't been shipped yet and you would like to change your delivery address, you can contact us.If you have other shipping consulting questions, refer to our shipping policy.","answer":"We offer a 30-day, no-hassle returns policy because we believe the only way to know if our bikes are suitable for you is to ride them. \n\nDon't hesitate to get in touch with us first. We will help you cancel the order and process to refund you, and the refund takes 5-8 business days back to your account."}},"text_dDXgid":{"type":"text","settings":{"title":"What is the warranty on my E-Bike?","answer":"We guarantee each new E-Bike's frame and original components against defects in craft and materials for one year from the day of delivery of your bike. It does not include parts subject to normal wear and tear (Brake Pads, Spokes, Tubes, Flywheel Pinion, Saddle, Kickstand.) and improper assembly or follow-up maintenance. See the complete warranty details here."}},"text_KMafaH":{"type":"text","settings":{"title":"How can I keep my E-Bike in tip-top shape?","answer":"Screw Joints\n\n-Check the vehicle regularly for loose screw connections according to the maintenance schedule and tighten loose screws with a torque wrench.\n\n-Do not ride the bicycle if you find loose screw joints.\n\n-Have loose screw joints checked by a professional if you lack the necessary expertise and tools.\n\nFrame and forks\n\n          -Check the frame and rigid fork for cracks, deformation, or discoloration.\n\n -If the frame or the forks is cracked, deformed, or discolored, contact the professional immediately.\n\n -Do not use the cycle if you find any cracks, deformation, or discoloration.\n\nSaddle\n\n-Check whether you can twist the saddle.\n\n-If you can twist the saddle, tighten the seat post clamp. Observe applicable torques.\n\n-Check whether you can move the saddle horizontally in the direction of travel or the opposite direction.\n\nIf you can move the saddle, adjust the saddle clamp.\n\nWheels\n\n-Check whether the front or rear wheel can move sideways and whether the wheel nuts move.\n\n-If the wheel nuts move, have a professional check the screw joints.\n\n-If the quick-release axle moves, adjust the axle.\n\n-If the front or rear wheel moves sideways, have a professional check the wheel.\n\n-Check whether there is an equal distance between the front wheel and the front fork or between the rear wheel and the frame.\n\n-If the distances are not identical, please have a professional check the front and rear wheels.\n\n-Lift the cycle and turn the front or rear wheel. Check whether the front or rear wheel swings sideways or outwards.\n\n-If the front or rear wheel swings sideways or outwards, please have a professional check the wheel.\n\n-Check the front and rear rims for cracks, deformation, or color changes at regular intervals.\n\n-Check whether the rim is under the inner tube and the rim tape.\n\n-Do not use the cycle if the rim is cracked, deformed, or discolored.\n\n-Have a professional check if there is any damage on the rim, materials, and aluminum.\n\n-Squeeze the spokes together gently with your thumb and fingers, checking whether\n\n-The tension is the same for all spokes. If the tension varies or spokes are loose, have a professional check the spokes tensioned.\n\nTires\n\nCheck whether the tire pressure is correct according to the data on the tire sidewall.\n\nCheck the tires for cracks and damage from foreign bodies.\n\nCheck whether you can feel the tire tread.\n\nIf a tire is cracked or damaged, or the tread depth is too low, have the tire replaced by a professional.\n\nBrake\n\n-It's crucial that you learn and remember which brake lever controls which brake (front\/rear) to ensure your safety.\n\n-To check which configuration your eBike is set up, squeeze one brake lever and see whether the front or rear brake engages. Now to the same with the other brake lever. Remember this configuration.\n\n-While testing the brake configuration, make sure that your hands can comfortably reach and squeeze the levers with no issues. If you experience any problems or discomfort operating the brakes, please reach out to us before riding.\n\n-Review the brake manufacturer's user manuals and care for your brakes correctly. \n\nBattery\n\n-It's essential to follow these instructions and safety tips to preserve the longevity of your battery's life and ensure proper performance.\n\n-Fully charge the battery before each ride to ensure it is ready to go the entire range. It will help reduce the chance of over-discharging the battery.\n\n-If the battery becomes physically damaged, non-functional, has been dropped, or involved in a crash, or you notice it performing abnormally, please discontinue use and contact the seller immediately.\n\nCharging your Battery\n\n-The charger is rated for 100-240V. Be sure to check the charger, the charger cables, and the battery for damage before beginning each charge.\n\n-Charging time takes about 3-4 hours. It may take longer to fully charge the battery on rare occasions, mainly when the bike is new or stored for a long time.\n\n-Only charge the battery with the supplied charger as others may cause damage to the battery or increase the possibility of fire or explosion.\n\n-While the charger is designed to stop charging once the battery is full automatically, please do not leave it plugged in for more than 12 hours.\n\n-Make sure your charger is isolated from liquids, dirt, and debris."}},"text_Hqi8J4":{"type":"text","settings":{"title":"How often should I get my bike serviced?","answer":"We set up every new e-bike to make sure it's ready to ride, but it's normal for some parts to work a little loose. To make sure you enjoy many years of smooth riding, we recommend getting your new bike checked by a professional after three months or 1000km of riding. Here's what they'll do:\n\n-Tighten and lube the chain\n\n- Adjust the brakes\n\n- Align the wheels\n\n- Check the gearing\n\n- Retighten all bolts\n\n- Lube the brake and shift cables\n\n- Check the tire pressure"}},"text_PHDape":{"type":"text","settings":{"title":"How to become your distributor?","answer":"Please apply now to become our official partner. Fill in the form, so we get in touch with you to explore the opportunities."}},"text_ThXjKq":{"type":"text","settings":{"title":"Do your e-bikes have regenerative brakes?","answer":"Not yet."}},"text_piPnFE":{"type":"text","settings":{"title":"What is pedal assist?","answer":"Pedal assist uses a cadence sensor built into the drivetrain of the e-bike. The sensor detects when the rider is revolving the pedals and signals the electric motor to provide the level of pedal assistance that has been selected."}},"text_QtcMBn":{"type":"text","settings":{"title":"Is it possible to reprogram the speed limit?","answer":"For your and your bicycle's safety and the laws in your location, please understand that we cannot provide \"cheat codes\" to our dear supporters."}},"text_X9eTmg":{"type":"text","settings":{"title":"Do I need to wear a helmet?","answer":"Yes."}},"text_eeDtmM":{"type":"text","settings":{"title":"Do the City Vanture comes assembled?","answer":"No, the City Vanture needs to be assembled by you. We will give you the instructions with the package, and we will also provide you with an installation video to ensure that you can install it smoothly. If you have any further questions, you can always contact us at service@vanpowers.com."}},"text_dcDVcY":{"type":"text","settings":{"title":"How can I track my order?","answer":"You can check your order's status on your account page. Besides, we'll send you a notification email regarding each stage of your order. Please contact service@vanpowers.com if you have any questions."}},"text_HdNQin":{"type":"text","settings":{"title":"How will shipping work?","answer":"We will ship directly to the address you provide."}},"text_Qt6HFd":{"type":"text","settings":{"title":"Who should I contact if I have other questions?","answer":"Please contact our amazing support team: service@vanpowers.com. Facebook Group: \/\/www.facebook.com\/groups\/364591248947656"}}},"block_order":["text_QqAWPn","text_ieHteJ","text_Xfpfx9","text_7pxnzW","text_pPXKK7","text_7UPbYt","text_qNLinU","text_mXyRh6","text_GRqdCx","text_dDXgid","text_KMafaH","text_Hqi8J4","text_PHDape","text_ThXjKq","text_piPnFE","text_QtcMBn","text_X9eTmg","text_eeDtmM","text_dcDVcY","text_HdNQin","text_Qt6HFd"],"settings":{"show":true,"title":"Frequently Asked Questions"}}},"order":["hnz-order-1","city_vanture_section_1_new_JbTCea","grandteton_parameters_KmijmW","urbancross_ultra_features_Q6axLB","aftersales_terms_YACLCt","grandteton_boxs_giL8en","hnz-product-review","recent-products","hnz_product_ug_pro_8_GbmLBN"]}